<template><div><h4 id="浏览器解析-url-过程" tabindex="-1"><a class="header-anchor" href="#浏览器解析-url-过程" aria-hidden="true">#</a> 浏览器解析 URL 过程</h4>
<ul>
<li>1、用户输入 URL 地址（解析url并发送URL请求）</li>
<li>2、对 URL 地址进行 DNS 域名解析获得IP地址。</li>
<li>（DNS解析过程：先在本机缓存区查找域名对应的IP，若本机缓存没有找到，那么就到本区域的DNS服务器查找，他会在每一层做一个缓存：有利于本区域的访问。DNS就是为了找到域名对应的IP地址，然后让浏览器可以找到对应的服务器）</li>
<li>3、和服务器建立 TCP 连接（三次握手）。</li>
<li>4、把客户端信息传递，浏览器向 web 服务器发送一个 HTTP 请求报文。</li>
<li>5、服务器收到并处理请求，返回 HTTP 响应报文（响应报文 【http状态码+响应头+响应体】）给客户端。</li>
<li>6、和服务器断开关闭 TCP 连接（四次挥手）。</li>
<li>7、客户端渲染服务器返回的内容，浏览器解析文档资源并渲染页面。</li>
</ul>
<h4 id="在地址栏输入网址之后-敲回车-都经历哪些过程" tabindex="-1"><a class="header-anchor" href="#在地址栏输入网址之后-敲回车-都经历哪些过程" aria-hidden="true">#</a> 在地址栏输入网址之后，敲回车，都经历哪些过程？</h4>
<ul>
<li>1、通过域名找到对应的IP地址</li>
<li>2、根据对应的IP地址找到对应的服务器，从服务器获取对应的资源，返回的基本都是html代码</li>
<li>3、解析html,根据DOM结构，渲染出一个DOM节点树，同时进行css样式数的渲染，合并样式树和节点树，形成render树，渲染render树（painting）（可以想象类似皮影，用竹竿搭架子和贴纸组成小动物，推出去让观众看到）</li>
</ul>
</div></template>


