<template><div><h5 id="http-状态代码含义" tabindex="-1"><a class="header-anchor" href="#http-状态代码含义" aria-hidden="true">#</a> HTTP 状态代码含义？</h5>
<p><strong>一二三四五原则</strong>:</p>
<blockquote>
<p>一. 消息系列
二 成功系列
三. 重定向系列
四. 请求错误系列
五. 服务器端错误系列</p>
</blockquote>
<hr>
<p><strong>常见错误：</strong></p>
<ul>
<li>302 :临时转移成功，请求的内容已转移到新位置</li>
<li>403: 禁止访问</li>
<li>500: 服务器内部错误 401代表未授权。</li>
<li>401: 代表未被授权</li>
<li>502: 错误网关，无效网关；</li>
</ul>
<hr>
<h5 id="_502解决方案" tabindex="-1"><a class="header-anchor" href="#_502解决方案" aria-hidden="true">#</a> 502解决方案：</h5>
<blockquote>
<p>1、检查服务器连接大多数网站都是通过多个服务器或第三方代理来运行的。如果你所在的服务器由于维护或其他原因关闭，你的网站可能会出现502 Bad Gateway Error页面。唯一的解决办法就是等待服务器完成维护或是修复好故障。
2、检查是否更改了DNS如果你近期更改了主机服务器或将网站移动到了其他IP地址下，就会更改网站的DNS服务器。这可能导致该网站无法访问，出现502 Bad Gateway Error页面。在这些DNS更改完成之前，你的网站可能需要几个小将才能启动并运行。
3、检查服务器日志服务器的日记的工作任务就是记录网站被访问的全过程，什么时间到什么时间有哪些人来过，什么搜索引擎来过，有没有收录你的网页。可以通过它来查看网站的健康状态。仔细检查日志内容可能会找出问题所在。
4、修复防火墙故障网站防火墙相当于网站的守卫者，保护你的网站免受非法用户的侵入和分布式拒绝服务（DDOS）的攻击。有时，防火墙设置错误会导致防火墙将从内容分发网络（CDN）过来的访问请求视为对服务器的攻击，因此拒绝其访问，从而导致502错误网关。
5、梳理网站代码查找漏洞如果网站的代码出现错误，服务器可能无法响应来自内容分发网络（CDN）的请求。梳理代码以查找漏洞或将代码复制到开发工具中。它将执行一个彻底的程序调试过程，该过程将模拟502错误网关是如何发生的，从而找出漏洞。</p>
</blockquote>
</div></template>


